; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v12 ?v7)
             (pred_11 ?v8 ?v9)
             (pred_9 ?v12 ?v9)
             (pred_12 ?v10 ?v12 )
	     (pred_10 ?v12)
             (pred_7 ?v6)
             (pred_2 ?v8)
             (pred_1 ?v9)
             (pred_6 ?v12)
             (pred_4 ?v8)
             (pred_5 ?v12)
             (pred_3 ))



(:action op_1
:parameters (?v1 ?v3 ?v4 ?v2)
:precondition (and (pred_7 ?v1) (pred_7 ?v3) (pred_2 ?v4) (pred_1 ?v2)
          (pred_8 ?v1 ?v3) (pred_11 ?v4 ?v2)
                   (pred_9 ?v3 ?v2) (pred_10 ?v1) 
                   (pred_6 ?v3) (pred_4 ?v4))
:effect (and  (pred_5 ?v3) (not (pred_6 ?v3))))


(:action op_4
:parameters (?v1 ?v13)
:precondition (and (pred_7 ?v1) (pred_7 ?v13)
               (pred_10 ?v1) (pred_8 ?v1 ?v13) (pred_5 ?v13))
:effect (and (pred_10 ?v13) (not (pred_10 ?v1))))

(:action op_5
:parameters (?v1 ?v4)
:precondition (and (pred_7 ?v1) (pred_2 ?v4) 
                  (pred_10 ?v1) (pred_12 ?v4 ?v1) (pred_3 ))
:effect (and (pred_4 ?v4)
   (not (pred_12 ?v4 ?v1)) (not (pred_3 ))))


(:action op_3
:parameters (?v1 ?v11 ?v5)
:precondition (and (pred_7 ?v1) (pred_2 ?v11) (pred_2 ?v5)
                  (pred_10 ?v1) (pred_4 ?v5) (pred_12 ?v11 ?v1))
:effect (and (pred_4 ?v11) (pred_12 ?v5 ?v1)
        (not (pred_4 ?v5)) (not (pred_12 ?v11 ?v1))))

(:action op_2
:parameters (?v1 ?v4)
:precondition (and (pred_7 ?v1) (pred_2 ?v4) 
                  (pred_10 ?v1) (pred_4 ?v4))
:effect (and (pred_3 ) (pred_12 ?v4 ?v1) (not (pred_4 ?v4)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_16 obj_18 obj_01 obj_06 obj_14 obj_10 obj_22 obj_09 obj_15 obj_12 obj_03 obj_02 obj_19 obj_21 obj_08 obj_05
    obj_04 obj_17 obj_07
    obj_13 obj_11 obj_20
    )

    (:init
       (pred_3)

       (pred_7 obj_16)
       (pred_7 obj_18)
       (pred_7 obj_01)
       (pred_7 obj_06)
       (pred_7 obj_14)
       (pred_7 obj_10)
       (pred_7 obj_22)
       (pred_7 obj_09)
       (pred_7 obj_15)
       (pred_7 obj_12)
       (pred_7 obj_03)
       (pred_7 obj_02)
       (pred_7 obj_19)
       (pred_7 obj_21)
       (pred_7 obj_08)
       (pred_7 obj_05)
       (pred_1 obj_04)
       (pred_1 obj_17)
       (pred_1 obj_07)
       (pred_2 obj_13)
       (pred_2 obj_11)
       (pred_2 obj_20)

       (pred_8 obj_16 obj_14)
       (pred_8 obj_16 obj_18)
       (pred_8 obj_18 obj_10)
       (pred_8 obj_18 obj_01)
       (pred_8 obj_18 obj_16)
       (pred_8 obj_01 obj_22)
       (pred_8 obj_01 obj_06)
       (pred_8 obj_01 obj_18)
       (pred_8 obj_06 obj_09)
       (pred_8 obj_06 obj_01)
       (pred_8 obj_14 obj_15)
       (pred_8 obj_14 obj_10)
       (pred_8 obj_14 obj_16)
       (pred_8 obj_10 obj_12)
       (pred_8 obj_10 obj_22)
       (pred_8 obj_10 obj_18)
       (pred_8 obj_10 obj_14)
       (pred_8 obj_22 obj_03)
       (pred_8 obj_22 obj_09)
       (pred_8 obj_22 obj_01)
       (pred_8 obj_22 obj_10)
       (pred_8 obj_09 obj_02)
       (pred_8 obj_09 obj_06)
       (pred_8 obj_09 obj_22)
       (pred_8 obj_15 obj_19)
       (pred_8 obj_15 obj_12)
       (pred_8 obj_15 obj_14)
       (pred_8 obj_12 obj_21)
       (pred_8 obj_12 obj_03)
       (pred_8 obj_12 obj_10)
       (pred_8 obj_12 obj_15)
       (pred_8 obj_03 obj_08)
       (pred_8 obj_03 obj_02)
       (pred_8 obj_03 obj_22)
       (pred_8 obj_03 obj_12)
       (pred_8 obj_02 obj_05)
       (pred_8 obj_02 obj_09)
       (pred_8 obj_02 obj_03)
       (pred_8 obj_19 obj_21)
       (pred_8 obj_19 obj_15)
       (pred_8 obj_21 obj_08)
       (pred_8 obj_21 obj_12)
       (pred_8 obj_21 obj_19)
       (pred_8 obj_08 obj_05)
       (pred_8 obj_08 obj_03)
       (pred_8 obj_08 obj_21)
       (pred_8 obj_05 obj_02)
       (pred_8 obj_05 obj_08)
       (pred_6 obj_05)
       (pred_6 obj_22)
       (pred_6 obj_03)
       (pred_9  obj_05 obj_04)
       (pred_9  obj_22 obj_17)
       (pred_9  obj_03 obj_07)
       (pred_5 obj_16)
       (pred_5 obj_18)
       (pred_5 obj_01)
       (pred_5 obj_06)
       (pred_5 obj_14)
       (pred_5 obj_10)
       (pred_5 obj_09)
       (pred_5 obj_15)
       (pred_5 obj_12)
       (pred_5 obj_02)
       (pred_5 obj_19)
       (pred_5 obj_21)
       (pred_5 obj_08)

       (pred_11  obj_13 obj_04)
       (pred_11  obj_11 obj_17)
       (pred_11  obj_20 obj_07)
       (pred_12 obj_13 obj_01)
       (pred_12 obj_11 obj_21)
       (pred_12 obj_20 obj_14)
       (pred_10 obj_12)
    )

    (:goal (and
       (pred_12 obj_11 obj_16)
       (pred_12 obj_20 obj_06)
    ))
(:constraints
  (always (not (pred_10 obj_10)))
)
)

; plan
1. (op_4 obj_12 obj_21)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_21)
   goals met: 0 of 2
2. (op_5 obj_21 obj_11)
   deleted: (pred_12 obj_11 obj_21) (pred_3)
   added: (pred_4 obj_11)
   goals met: 0 of 2
3. (op_4 obj_21 obj_12)
   deleted: (pred_10 obj_21)
   added: (pred_10 obj_12)
   goals met: 0 of 2
4. (op_4 obj_12 obj_15)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_15)
   goals met: 0 of 2
5. (op_4 obj_15 obj_14)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_14)
   goals met: 0 of 2
6. (op_4 obj_14 obj_16)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_16)
   goals met: 0 of 2
7. (op_2 obj_16 obj_11)
   deleted: (pred_4 obj_11)
   added: (pred_3) (pred_12 obj_11 obj_16)
   goals met: 1 of 2
8. (op_4 obj_16 obj_14)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_14)
   goals met: 1 of 2
9. (op_5 obj_14 obj_20)
   deleted: (pred_12 obj_20 obj_14) (pred_3)
   added: (pred_4 obj_20)
   goals met: 1 of 2
10. (op_4 obj_14 obj_16)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_16)
   goals met: 1 of 2
11. (op_4 obj_16 obj_18)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_18)
   goals met: 1 of 2
12. (op_4 obj_18 obj_01)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_01)
   goals met: 1 of 2
13. (op_4 obj_01 obj_06)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_06)
   goals met: 1 of 2
14. (op_2 obj_06 obj_20)
   deleted: (pred_4 obj_20)
   added: (pred_3) (pred_12 obj_20 obj_06)
   goals met: 2 of 2
